Show / Hide Table of Contents
Class AutomationService<ClientInterface>
Inheritance
System.Object
AutomationService<ClientInterface>
Implements
IAutomation
IClientBIM<ClientInterface>
System.IDisposable
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin
Assembly: IdeaStatiCa.Plugin.dll
Syntax
public class AutomationService<ClientInterface> : IAutomation, IClientBIM<ClientInterface>, IDisposable
Type Parameters
 Name |  Description
 ClientInterface
Constructors
Improve this Doc   View Source
AutomationService()
Declaration
public AutomationService()
Properties
Improve this Doc   View Source
BIM
Declaration
public ClientInterface BIM { get; set; }
Property Value
 Type |  Description
 ClientInterface
Improve this Doc   View Source
ProjectDir
Declaration
public virtual string ProjectDir { get; }
Property Value
 Type |  Description
 System.String
Improve this Doc   View Source
Status
Declaration
public AutomationStatus Status { get; protected set; }
Property Value
 Type |  Description
 AutomationStatus
Improve this Doc   View Source
TempWorkingDir
Declaration
public virtual string TempWorkingDir { get; }
Property Value
 Type |  Description
 System.String
Methods
Improve this Doc   View Source
CloseProject()
Declaration
public virtual void CloseProject()
Improve this Doc   View Source
Dispose()
Declaration
public void Dispose()
Improve this Doc   View Source
Dispose(Boolean)
Declaration
protected virtual void Dispose(bool disposing)
Parameters
 Type |  Name |  Description
 System.Boolean |  disposing
Improve this Doc   View Source
NotifyChange()
Declaration
public virtual void NotifyChange()
Improve this Doc   View Source
OpenProject(String)
Declaration
public virtual void OpenProject(string fileName)
Parameters
 Type |  Name |  Description
 System.String |  fileName
Improve this Doc   View Source
Refresh()
Declaration
public virtual void Refresh()
Improve this Doc   View Source
RefreshProject()
Declaration
public virtual void RefreshProject()
Improve this Doc   View Source
SelectItem(String)
Declaration
public virtual void SelectItem(string itemId)
Parameters
 Type |  Name |  Description
 System.String |  itemId
Improve this Doc   View Source
Shutdown()
Declaration
public virtual void Shutdown()
Implements
 IAutomation
 IClientBIM<B>
 System.IDisposable
 Improve this Doc
 View Source